# Quick Reference

### [Markdown Reference](https://medium.com/ibm-data-science-experience/markdown-for-jupyter-notebooks-cheatsheet-386c05aeebed)
### [Markdown Basics](https://daringfireball.net/projects/markdown/)
### [Extensions and Themes](https://towardsdatascience.com/bringing-the-best-out-of-jupyter-notebooks-for-data-science-f0871519ca29)
### [Bringing the best out of Jupyter Notebooks for Data Science](https://towardsdatascience.com/bringing-the-best-out-of-jupyter-notebooks-for-data-science-f0871519ca29)

To comment inline, mac cmd + /
- [Base Imports](#base_imports)
- [Create Dataframe](#create_dataframe)
- [Show frame information](#dataframe_info)
- [Load a CSV file](#load_csv_file)
- [Load a Excel file](#load_excel_file)
- [Dataframe components: index, columns, values](#dataframe_components)
- [Rename_Columns](#rename_columns)
- [Select_Columns](#select_columns)
- [Add new column](#add_new_column)
- [drop_columns](#drop_columns)
- [Sorting](#sorting)
- Datetime functions
- Grouping and aggregation
- Convert series to frames
- Create composite frames
- Drop duplicates
- [Convert to percentage](#convert_to_pct)

<a id='base_imports'></a>
### Base Imports

In [5]:
import numpy as np  # useful for many scientific computing in Python
import pandas as pd # primary data structure library

<a id='create_dataframe'></a>
### Create Dataframe

In [6]:
def initFrame():
    df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test1","train1"]),
                    'F' : 'foo' })
    return df2

df2=initFrame()

In [3]:
# Define a dictionary containing Students data 
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
  
# Declare a list that is to be converted into a column 
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna'] 
  
# Using 'Address' as the column name 
# and equating it to the list 
df['Address'] = address 
  
# Observe the result 
df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

<a id='dataframe_info'></a>
### Dataframe info: Info, head, shape, and validation

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
A    4 non-null float64
B    4 non-null datetime64[ns]
C    4 non-null float32
D    4 non-null int32
E    4 non-null category
F    4 non-null object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 356.0+ bytes

In [8]:
df2.head()

     A          B    C  D       E    F
0  1.0 2013-01-02  1.0  3    test  foo
1  1.0 2013-01-02  1.0  3   train  foo
2  1.0 2013-01-02  1.0  3   test1  foo
3  1.0 2013-01-02  1.0  3  train1  foo

In [10]:
print(df2.shape)

(4, 6)

In [23]:
# Examine the types of the column labels to ensure they are strings
# all(isinstance(column, str) for column in df2.columns
# Convert to string if needed
# df2.columns = list(map(str, df2.columns))

<a id='load_csv_file'></a>
### Load CSV File

In [ ]:
pd.read_csv('data.csv')
pd.read_csv('Topic_Survey_Assignment.csv',index_col=0)

<a id='load_excel_file'></a>
### Load Excel File

In [ ]:
df_can = pd.read_excel('VA22PWPSQL003_last7 days.xlsx',
                       sheet_name='Disk Detail',
                       skiprows=range(10),
                       skipfooter=0)

<a id='dataframe_components'></a>
### Dataframe components

In [115]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [116]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [117]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test1', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train1', 'foo']],
      dtype=object)

<a id='rename_columns'></a>
### Rename columns

In [15]:
# By column nndex
df2.rename(columns={ df2.columns[2]: "newName1" })
# By column name
df2.rename(columns={'A': 'newName1', 'B': 'newName2'})
# Assign directly
df2.columns = ['new1','new2','new3','new4','new5','new6']
df2.head()

   new1       new2  new3  new4   new5 new6
0   1.0 2013-01-02   1.0     3   test  foo
1   1.0 2013-01-02   1.0     3  train  foo
2   1.0 2013-01-02   1.0     3   test  foo
3   1.0 2013-01-02   1.0     3  train  foo

<a id='select_columns'></a>
### Select columns

In [23]:
df2=initFrame()
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [44]:
# Select columns
# Single column
df2['A']
# Multiple columns
df2[['A','B']]

# iloc integer selection [row selection:column selection]
# First column first row
df2.iloc[1:1]
# First row all columns
df2.iloc[:0]
# Second column all rows
df2.iloc[:,1]
# Last column
df2.iloc[:,-1]
# First 2 rows
df2.iloc[0:2]
# First 2 columns all rows
df2.iloc[:, 0:2]
# First and second rows, second and fourth column
df2.iloc[[0,3], [1,3]]
# First 3 rows, columns 2 and 3
df2.iloc[0:3, 1:3]

             B    C  D      E    F
A
1.0 2013-01-02  1.0  3   test  foo
1.0 2013-01-02  1.0  3  train  foo
1.0 2013-01-02  1.0  3   test  foo
1.0 2013-01-02  1.0  3  train  foo

In [56]:
# Selections using the loc method are based on the index of the data frame (if any). 
# Where the index is set on a DataFrame, using df.set_index(), 
# the .loc method directly selects based on index values of any rows. 
#  Label-based / Index-based indexing using .loc
df2=initFrame()
df2.set_index("E", inplace=True)
df2.head()

          A          B    C  D    F
E
test    1.0 2013-01-02  1.0  3  foo
train   1.0 2013-01-02  1.0  3  foo
test1   1.0 2013-01-02  1.0  3  foo
train1  1.0 2013-01-02  1.0  3  foo

In [59]:
# Select by row
df2.loc['train']
# Select multiple rows
df2.loc[['train','test']]
# Select rows and specific columns
df2.loc[['train'],['A','C']]
# Range of rows and columns
df2.loc['test':'test1', ['A','D']]
# Range of rows and columns
df2.loc[['test','test1'], 'B':'D']

               B    C  D
E
test  2013-01-02  1.0  3
test1 2013-01-02  1.0  3

<a id='add_new_column'></a>
### Add new column

In [27]:
df2=initFrame()
df2['the_total'] = df2.sum(axis=1)
df2.head()

     A          B    C  D       E    F  the_total
0  1.0 2013-01-02  1.0  3    test  foo        5.0
1  1.0 2013-01-02  1.0  3   train  foo        5.0
2  1.0 2013-01-02  1.0  3   test1  foo        5.0
3  1.0 2013-01-02  1.0  3  train1  foo        5.0

In [ ]:
# Just specify a new field using the locator function
odw3['timeseries'] = odw3.apply(lambda row: 
           datetime.datetime.strptime(row['Date'].strftime('%Y-%m-%d') + ' ' + str(int(row['Hour'])) + ':' + str(int(row['Minutes'])),
                                      '%Y-%m-%d %H:%M'), axis=1)

# concat
tmp2=tmp['timeseries'].drop_duplicates()
tmp2.concat(tmp.iloc[:,1:3].T)

<a id='drop_columns'></a>
### Drop columns

In [13]:
df2=initFrame()
df2=df2.drop(['A'], axis=1)
df2.drop(['B', 'F'], axis=1, inplace=True)
df2.head()

     C  D       E
0  1.0  3    test
1  1.0  3   train
2  1.0  3   test1
3  1.0  3  train1

<a id='sorting'></a>
### Sorting

In [ ]:
odw3.sort_values(['timeseries'], ascending=False, axis=0, inplace=True)

### Datetime

In [ ]:
import datetime
odw3.apply(lambda row: 
           datetime.datetime.strptime(row['Date'].strftime('%Y-%m-%d') + ' ' + str(int(row['Hour'])) + ':' + str(int(row['Minutes'])),
                                      '%Y-%m-%d %H:%M'), axis=1)

### Boolean / Logical indexing using .loc
Conditional selections with boolean arrays using data.loc[<selection>].  With boolean indexing or logical selection, you pass an array or Series of True/False values to the .loc indexer to select the rows where your Series has True values.

In [88]:
df2=initFrame()
df2.set_index("A", inplace=True)
df2.loc[df2['E'] == 'test1',['C','F']]

       C    F
A
1.0  1.0  foo

In [90]:
# Results as dataframe and series
# Returned a dataframe
df2.loc[df2['E'] == 'test1', ['C']]
# Returned series
df2.loc[df2['E'] == 'test1', 'C']

A
1.0    1.0
Name: C, dtype: float32

In [105]:
# Other conditional selects
df2.loc[df2['E'].str.endswith("1")] 
df2.loc[df2['E'].isin(['train', 'train1'])] 
# Conjunction and/or
df2.loc[df2['E'].str.endswith("1") & (df2['E'] == 'test')] 
df2.loc[df2['E'].str.endswith("1") | (df2['E'] == 'test')]

Empty DataFrame
Columns: [C, D, F]
Index: []

In [106]:
# A lambda function that yields True/False values can also be used.
# Select rows where the company name has 4 words in it.
df2.loc[df2['E'].apply(lambda x: len(x.split(' ')) == 4)] 
 
# Selections can be achieved outside of the main .loc for clarity:
# Form a separate variable with your selections:
idx = df2['E'].apply(lambda x: len(x.split(' ')) == 4)
# Select only the True values in 'idx' and only the 3 columns specified:
df2.loc[idx, ['C', 'D', 'F']]
# Apply lambda to a specific row set axis=1, default=0 for column
tp['col'] = tp.apply(lambda row: row['source'] if row['target'] in ['b', 'n'] else 'x',
                     axis=1)

Empty DataFrame
Columns: [C, D, F]
Index: []

### Grouping and aggregation

In [118]:
df2=initFrame()
df2series=df2.groupby(['F'])['D'].agg('sum')
df2series

F
foo    12
Name: D, dtype: int32

### Convert series to frames

In [119]:
df2series.to_frame().reset_index()

     F   D
0  foo  12

### Create composite frames

In [120]:
new = old[['A', 'C', 'D']].copy()
new = old.filter(['A','B','D'], axis=1)
new = old.drop('B', axis=1)

NameError: name 'old' is not defined

### Drop Duplicates

In [ ]:
DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)[source]

<a id='convert_to_pct'></a>
### Convert to percentages

In [ ]:
(100. * df / df.sum()).round(1).astype(str) + '%'